PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/include/cy_tcpwm_counter.h
/***************************************************************************//**
* \file cy_tcpwm_counter.h
* \version 1.80
*
* \brief
* The header file of the TCPWM Timer Counter driver.
*
********************************************************************************
* \copyright
* Copyright 2016-2025 Cypress Semiconductor Corporation (an Infineon company) or
* an affiliate of Cypress Semiconductor Corporation.
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/
#if !defined(CY_TCPWM_COUNTER_H)
#define CY_TCPWM_COUNTER_H

#include "cy_tcpwm.h"

#ifdef CY_IP_MXTCPWM

#if defined(__cplusplus)
extern "C" {
#endif

/**
* \addtogroup group_tcpwm_counter
* \{
* Driver API for Timer/Counter.
*
* The functions and other declarations used in this part of the driver are
* in cy_tcpwm_counter.h. You can also include cy_pdl.h
* to get access to all functions and declarations in the PDL.
*
* Use Timer/Counter mode whenever a specific timing interval or measurement is
* needed. Examples include:
* * Creating a periodic interrupt for running other system tasks
* * Measuring frequency of an input signal
* * Measuring pulse width of an input signal
* * Measuring time between two external events
* * Counting events
* * Triggering other system resources after x number events
* * Capturing time stamps when events occur
*
* The Timer/Counter has the following features:
* * 16- or 32-bit Timer/Counter.
* * Programmable Period Register.
* * Programmable Compare Register. Compare value can be swapped with a
* buffered compare value on comparison event.
* * Capture with buffer register.
* * Count Up, Count Down, or Count Up and Down Counting modes.
* * Continuous or One Shot Run modes.
* * Interrupt on Terminal Count and Compare or Capture 0. Interrupt on Compare or Capture 1 is only available in TCPWM Version 2.
* * Start, Reload, Stop, Capture, and Count Inputs.
* * 2 compare (CC0/CC1) registers with double buffer, Capture 1 event. Second compare
* register and Capture 1 event are available only in TCPWM Version 2.
* * Two programmable trigger outputs, trig_out0 and trig_out1 that generate a
* trigger on one of the following events Overflow, Underflow, Terminal Count,
* and Compare Match 0/1. The available triggers are dependent on the Timer/Counter mode.
* All these features are only available in TCPWM Version 2.
* * Overflow, Underflow, and Compare(cc_match) trigger outputs are only available in TCPWM Version 1.
* * Second Compare Match (CC_MATCH1) event is only available in TCPWM Version 2.
*
* \section group_tcpwm_counter_configuration Configuration Considerations
*
* The Counter configuration can be divided to number of sequential
* steps listed below:
* * \ref group_tcpwm_counter_config
* * \ref group_tcpwm_counter_clock
* * \ref group_tcpwm_counter_enable
* * \ref group_tcpwm_counter_start
*
* \subsection group_tcpwm_counter_config Configure Counter
* To configure Counter, provide the configuration parameters in the
* \ref cy_stc_tcpwm_counter_config_t structure. The Configuration structure
* can be modified through software, but if the configurator in ModusToolbox is used
* then the configuration structure will be updated with the users input. To initialize
* the driver, call \ref Cy_TCPWM_Counter_Init function providing a pointer to the populated
* \ref cy_stc_tcpwm_counter_config_t structure.
*
* For TCPWM V1 Configuration
* \snippet tcpwm/counter/snippet/main.c snippet_Cy_TCPWM_V1_Counter_Init
*
* TCPWM V2 Configuration
* \snippet tcpwm/counter/snippet/main.c snippet_Cy_TCPWM_V2_Counter_Init
*
* \subsection group_tcpwm_counter_clock Assign Clock Divider
* The clock source must be connected to proper working.
* Any of the peripheral clock dividers could be used. Use the
* \ref group_sysclk driver API to do that.
*
* \subsection group_tcpwm_counter_enable Enable Counter
* Counter has to be enabled before starting
*
* \snippet tcpwm/counter/snippet/main.c snippet_Cy_TCPWM_Counter_Enable
*
* \subsection group_tcpwm_counter_start Start Counter
* Counter has to be started
*
* \snippet tcpwm/counter/snippet/main.c snippet_Cy_TCPWM_Counter_Start
*
*/

/**
* \defgroup group_tcpwm_macros_counter          Macros
* \defgroup group_tcpwm_functions_counter       Functions
* \defgroup group_tcpwm_data_structures_counter Data Structures
* \} */

/**
* \addtogroup group_tcpwm_data_structures_counter
* \{
*/
#if (CY_IP_MXTCPWM_VERSION >= 3U) || defined (CY_DOXYGEN)
/** Counter Direction modes  */
typedef enum
{
    CY_TCPWM_COUNTER_DIRECTION_DISABLE  = 0UL, /**< Counter changes current count direction is disabled */
    CY_TCPWM_COUNTER_DIRECTION_FALLING  = 1UL, /**< Counter changes current count direction based on falling edge of capture0 input */
    CY_TCPWM_COUNTER_DIRECTION_RISING   = 2UL, /**< Counter changes current count direction based on rising edge of capture0 input */
    CY_TCPWM_COUNTER_DIRECTION_LEVEL    = 3UL, /**< Counter count increase when capture0 level equal to high, counter count decrease when capture0 level equals to low */
} cy_en_counter_direction_t;
#endif /* (CY_IP_MXTCPWM_VERSION >= 3U) || defined (CY_DOXYGEN) */
/** Counter Timer configuration structure */
typedef struct cy_stc_tcpwm_counter_config
{
    uint32_t    period;             /**< Sets the period of the counter */
    /** Sets the clock prescaler inside the TCWPM block. See \ref group_tcpwm_counter_clk_prescalers */
    uint32_t    clockPrescaler;
    uint32_t    runMode;            /**< Sets the run mode. See \ref group_tcpwm_counter_run_modes */
    uint32_t    countDirection;     /**< Sets the counter direction. See \ref group_tcpwm_counter_direction */
    /** The counter can either compare or capture a value. See \ref group_tcpwm_counter_compare_capture */
    uint32_t    compareOrCapture;
    uint32_t    compare0;           /**< Sets the value for Compare0*/
    uint32_t    compare1;           /**< Sets the value for Compare1*/
    bool        enableCompareSwap;  /**< If enabled, the compare values are swapped each time the comparison is true */
    /** Enabled an interrupt on the terminal count, capture or compare. See \ref group_tcpwm_interrupt_sources */
    uint32_t    interruptSources;
    uint32_t    captureInputMode;   /**< Configures how the capture input behaves. See \ref group_tcpwm_input_modes */
    /** Selects which input the capture uses, the inputs are device-specific. See \ref group_tcpwm_input_selection */
    uint32_t    captureInput;
    uint32_t    reloadInputMode;    /**< Configures how the reload input behaves. See \ref group_tcpwm_input_modes */
    /** Selects which input the reload uses, the inputs are device-specific. See \ref group_tcpwm_input_selection */
    uint32_t    reloadInput;
    uint32_t    startInputMode;     /**< Configures how the start input behaves. See \ref group_tcpwm_input_modes */
    /** Selects which input the start uses, the inputs are device-specific. See \ref group_tcpwm_input_selection */
    uint32_t    startInput;
    uint32_t    stopInputMode;      /**< Configures how the stop input behaves. See \ref group_tcpwm_input_modes */
    /** Selects which input the stop uses, the inputs are device-specific. See \ref group_tcpwm_input_selection */
    uint32_t    stopInput;
    uint32_t    countInputMode;     /**< Configures how the count input behaves. See \ref group_tcpwm_input_modes */
    uint32_t    countInput;         /**< Selects which input the count uses, the inputs are device-specific. See \ref group_tcpwm_input_selection */
#if (CY_IP_MXTCPWM_VERSION >= 2U) || defined (CY_DOXYGEN)
    uint32_t    capture1InputMode;  /**< Configures how the capture1 input behaves. See \ref group_tcpwm_input_modes */
    uint32_t    capture1Input;      /**< Selects which input the capture1 uses, the inputs are device-specific. */
    /** See \ref group_tcpwm_input_selection */
    bool        enableCompare1Swap; /**< If enabled, the compare1 values are swapped each time the comparison is true */
    uint32_t    compare2;           /**< Sets the value for Compare1  */
    uint32_t    compare3;           /**< Sets the value for the buffered Compare1 */
    uint32_t    trigger0Event;      /**< Configures which internal event generates on output trigger 0*/
    uint32_t    trigger1Event;      /**< Configures which internal event generates on output trigger 1*/
#endif /* (CY_IP_MXTCPWM_VERSION >= 2U) || defined (CY_DOXYGEN) */
#if (CY_IP_MXTCPWM_VERSION >= 3U) || defined (CY_DOXYGEN)
    bool        buffer_swap_enable; /**< Configures swapping mechanism between CC0 and buffered CC0, CC1 and buffered CC1, PERIOD and buffered PERIOD, DT and buffered DT  */
    cy_en_counter_direction_t direction_mode; /**< Counter direction mode */
    bool        glitch_filter_enable;   /**< Enables Glitch filter for input triggers. */
    cy_en_gf_depth_value_t gf_depth;    /**< Glitch filter depth value. */
#endif /* (CY_IP_MXTCPWM_VERSION >= 3U) || defined (CY_DOXYGEN) */
} cy_stc_tcpwm_counter_config_t;
/** \} group_tcpwm_data_structures_counter */

/**
* \addtogroup group_tcpwm_macros_counter
* \{
* \defgroup group_tcpwm_counter_run_modes Counter Run Modes
* \{
* Run modes for the counter timer.
*/
#define CY_TCPWM_COUNTER_ONESHOT                (1U)    /**< Counter runs once and then stops */
#define CY_TCPWM_COUNTER_CONTINUOUS             (0U)    /**< Counter runs forever */
/** \} group_tcpwm_counter_run_modes */

/** \defgroup group_tcpwm_counter_direction Counter Direction
* The counter directions.
* \{
*/
#define CY_TCPWM_COUNTER_COUNT_UP               (0U)    /**< Counter counts up */
#define CY_TCPWM_COUNTER_COUNT_DOWN             (1U)    /**< Counter counts down */
/** Counter counts up and down terminal count only occurs on underflow. */
#define CY_TCPWM_COUNTER_COUNT_UP_DOWN_1        (2U)
/** Counter counts up and down terminal count occurs on both overflow and underflow. */
#define CY_TCPWM_COUNTER_COUNT_UP_DOWN_2        (3U)
/** \} group_tcpwm_counter_direction */

/** \defgroup group_tcpwm_counter_clk_prescalers Counter CLK Prescalers
* \{
* The clock prescaler values.
*/
#define CY_TCPWM_COUNTER_PRESCALER_DIVBY_1      (0U) /**< Divide by 1 */
#define CY_TCPWM_COUNTER_PRESCALER_DIVBY_2      (1U) /**< Divide by 2 */
#define CY_TCPWM_COUNTER_PRESCALER_DIVBY_4      (2U) /**< Divide by 4 */
#define CY_TCPWM_COUNTER_PRESCALER_DIVBY_8      (3U) /**< Divide by 8 */
#define CY_TCPWM_COUNTER_PRESCALER_DIVBY_16     (4U) /**< Divide by 16 */
#define CY_TCPWM_COUNTER_PRESCALER_DIVBY_32     (5U) /**< Divide by 32 */
#define CY_TCPWM_COUNTER_PRESCALER_DIVBY_64     (6U) /**< Divide by 64 */
#define CY_TCPWM_COUNTER_PRESCALER_DIVBY_128    (7U) /**< Divide by 128 */
/** \} group_tcpwm_counter_clk_prescalers */

/** \defgroup group_tcpwm_counter_compare_capture Counter Compare Capture
* \{
* A compare or capture mode.
*/
#define CY_TCPWM_COUNTER_MODE_CAPTURE           (2U)  /**< Timer/Counter is in Capture Mode */
#define CY_TCPWM_COUNTER_MODE_COMPARE           (0U)  /**< Timer/Counter is in Compare Mode */
/** \} group_tcpwm_counter_compare_capture */

/** \defgroup group_tcpwm_counter_status Counter Status
* \{
* The counter status.
*/
#define CY_TCPWM_COUNTER_STATUS_DOWN_COUNTING   (0x1UL)        /**< Timer/Counter is down counting */
#define CY_TCPWM_COUNTER_STATUS_UP_COUNTING     (0x2UL)        /**< Timer/Counter is up counting */
#if (CY_IP_MXTCPWM_VERSION >= 3U) || defined (CY_DOXYGEN)
#define CY_TCPWM_COUNTER_STATUS_CC0_READ_MISS   (0x4UL)        /**< Timer/Counter is miss reading the last capture0 event */
#define CY_TCPWM_COUNTER_STATUS_CC1_READ_MISS   (0x8UL)        /**< Timer/Counter is miss reading the last capture1 event */
#define CY_TCPWM_COUNTER_STATUS_KILL            (0x10UL)       /**< Timer/Counter has active kill event */
#endif /* (CY_IP_MXTCPWM_VERSION >= 2U) || defined (CY_DOXYGEN) */
#define CY_TCPWM_COUNTER_STATUS_COUNTER_RUNNING (0x80000000UL) /**< Timer/Counter is running */

/** \} group_tcpwm_counter_status */
/** \} group_tcpwm_macros_counter */


